<center>
    <img src="https://weclouddata.s3.amazonaws.com/images/logos/wcd_logo_new_2.png" width='30%'>
</center>

----------

<h1 align="center"> Pandas SQL </h1>
<br>
<br>
<center align="left"> <font size='4'>  Developed by: </font><font size='4' color='#33AAFBD'>WeCloudData</font></center>
<br>

----------

In this exercise we will introduce **"pandasql"**.  This python package allow you to write SQL querry on Pandas DataFrame. Sometime we do not know that, what will be appropriate api to perform some explicit tasks using Pandas on DataFrames. The person who knows SQL they can apply SQL querries to perform even very complex task using SQL.

Using pandasql package we are going to perform following tasks.
- Column Selection
- Data Filtering
- Data aggregation
- Data Joining

**Important Component of package pandasql**

- load_births  : Load data set births
- load_meat : Load DataSet meat
- sqldf : A function which can be use to run SQL on pandas dataframes.

In [2]:
pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\habob\anaconda3\lib\site-packages (from pandasql) (1.24.3)
Requirement already satisfied: pandas in c:\users\habob\anaconda3\lib\site-packages (from pandasql) (2.0.3)
Requirement already satisfied: sqlalchemy in c:\users\habob\anaconda3\lib\site-packages (from pandasql) (2.0.21)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\habob\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\habob\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\habob\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\habob\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\habob\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (2.0.1)
Requirement already satisfied: six>=1.5 in c:\users\habob\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26800 sha256=c5ed5a2df32102120ade364959f0144365f0aa5988781ae2311708f6dc54ddc7
  Stored in directory: c:\users\habob\appdata\local\pip\cache\wheels\68\5d\a5\edc271b998f909801d7956959f699b976cc9896075dc47c153
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3
Note: you may need to restart the kernel to use updated packages.

In [3]:
## Importing pandasql
import pandasql as psql

In [4]:
##  Birth Data Set
birth = psql.load_births()
birth.head()

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [5]:
##  Meat Data Set
meat = psql.load_meat()
meat.head()

,date,beef,veal,pork,lamb_and_mutton,broilers,other_chicken,turkey
0,1944-01-01,751.0,85.0,1280.0,89.0,NaN,NaN,NaN
1,1944-02-01,713.0,77.0,1169.0,72.0,NaN,NaN,NaN
2,1944-03-01,741.0,90.0,1128.0,75.0,NaN,NaN,NaN
3,1944-04-01,650.0,89.0,978.0,66.0,NaN,NaN,NaN
4,1944-05-01,681.0,106.0,1029.0,78.0,NaN,NaN,NaN

In [6]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import os

To run SQL on DataFrame, I am using Toy data set. But, first of all let me explain about sqldf() method.

### Method sqldf()
- Run sql on dataframes.
- I am just going to discuss about its one input argument that is sql querry as String.

In [7]:
toydf = pd.read_csv('toy_dataset.csv',header=0)

In [8]:
toydf.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [9]:
toydf.City.unique()

array(['Dallas', 'New York City', 'Los Angeles', 'Mountain View',
       'Boston', 'Washington D.C.', 'San Diego', 'Austin'], dtype=object)

In [10]:
toydf.Age.describe()

count    150000.000000
mean         44.950200
std          11.572486
min          25.000000
25%          35.000000
50%          45.000000
75%          55.000000
max          65.000000
Name: Age, dtype: float64

In [11]:
toydf.Income.describe()

count    150000.000000
mean      91252.798273
std       24989.500948
min        -654.000000
25%       80867.750000
50%       93655.000000
75%      104519.000000
max      177157.000000
Name: Income, dtype: float64

In [16]:
(toydf.Income == -654.000000).sum()

1

In [12]:
toydf.Illness.unique()

array(['No', 'Yes'], dtype=object)

### Data Selection

In [17]:
sdf =  psql.sqldf("select Age, Income from toydf")
sdf.head()

   Age   Income
0   41  40367.0
1   54  45084.0
2   42  52483.0
3   40  40941.0
4   46  50289.0

In [18]:
sdfc =  psql.sqldf("select Age, Income, City from toydf")
sdfc.head()

   Age   Income    City
0   41  40367.0  Dallas
1   54  45084.0  Dallas
2   42  52483.0  Dallas
3   40  40941.0  Dallas
4   46  50289.0  Dallas

In [19]:
sdfc1 =  psql.sqldf("select Age, Income, City from toydf limit 5")
sdfc1.head()

   Age   Income    City
0   41  40367.0  Dallas
1   54  45084.0  Dallas
2   42  52483.0  Dallas
3   40  40941.0  Dallas
4   46  50289.0  Dallas

### Data Filtering : Wee need all the Rows where City is Dallas

In [20]:
dallasDf = psql.sqldf("select * from toydf where City ='Dallas'")

In [21]:
dallasDf.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [22]:
dallasDf1 = psql.sqldf("select * from toydf where City ='Dallas' limit 5")

In [23]:
dallasDf1

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [24]:
dallasDf1 = psql.sqldf("select * from toydf where City ='Dallas' and Age > 30 limit 5")

In [25]:
dallasDf1

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

### Data Aggregation

In [26]:
cdf = psql.sqldf("select count(*), City from toydf group by City")

In [27]:
cdf.head()

   count(*)           City
0     12292         Austin
1      8301         Boston
2     19707         Dallas
3     32173    Los Angeles
4     14219  Mountain View

In [29]:
## This query will return average age City wise
cdf1 = psql.sqldf("select avg(Age) as Avg_Age, City from toydf group by City")
cdf1.head()

     Avg_Age           City
0  44.651237         Austin
1  45.197807         Boston
2  45.058761         Dallas
3  44.994094    Los Angeles
4  44.992756  Mountain View

In [30]:
## This query will return average age and Income grouped on City and Gender
cdf2 = psql.sqldf("select avg(Age),avg(Income), City, Gender from toydf group by City, Gender")
cdf2.head()

    avg(Age)   avg(Income)    City  Gender
0  44.505478  84958.760631  Austin  Female
1  44.764876  94424.246272  Austin    Male
2  45.219112  85978.442530  Boston  Female
3  45.180549  96071.649368  Boston    Male
4  45.141987  39602.533142  Dallas  Female

Hope you have enjoyed this kernel. If enjoy do upvote it.

# Inner Join

In [31]:
importDf = pd.read_csv("2018-2010_import.csv",header=0)
exportDf = pd.read_csv("2018-2010_export.csv",header=0)

In [32]:
importDf.head()

,HSCode,Commodity,value,country,year
0,5,"PRODUCTS OF ANIMAL ORIGIN, NOT ELSEWHERE SPECI...",0.00,AFGHANISTAN TIS,2018
1,7,EDIBLE VEGETABLES AND CERTAIN ROOTS AND TUBERS.,12.38,AFGHANISTAN TIS,2018
2,8,EDIBLE FRUIT AND NUTS; PEEL OR CITRUS FRUIT OR...,268.60,AFGHANISTAN TIS,2018
3,9,"COFFEE, TEA, MATE AND SPICES.",35.48,AFGHANISTAN TIS,2018
4,11,PRODUCTS OF THE MILLING INDUSTRY; MALT; STARCH...,NaN,AFGHANISTAN TIS,2018

In [33]:
exportDf.head()

,HSCode,Commodity,value,country,year
0,2,MEAT AND EDIBLE MEAT OFFAL.,0.18,AFGHANISTAN TIS,2018
1,3,"FISH AND CRUSTACEANS, MOLLUSCS AND OTHER AQUAT...",0.00,AFGHANISTAN TIS,2018
2,4,DAIRY PRODUCE; BIRDS' EGGS; NATURAL HONEY; EDI...,12.48,AFGHANISTAN TIS,2018
3,6,LIVE TREES AND OTHER PLANTS; BULBS; ROOTS AND ...,0.00,AFGHANISTAN TIS,2018
4,7,EDIBLE VEGETABLES AND CERTAIN ROOTS AND TUBERS.,1.89,AFGHANISTAN TIS,2018

In [34]:
importDf.HSCode.describe()

count    76124.000000
mean        53.905023
std         27.546852
min          1.000000
25%         30.000000
50%         54.000000
75%         78.000000
max         99.000000
Name: HSCode, dtype: float64

In [35]:
exportDf1 = psql.sqldf("select * from exportDf where HSCode <30")
importDf1 = psql.sqldf("select * from importDf where HSCode <30")

In [37]:
joinedData = psql.sqldf("select i.HSCode, i.value as importVal, e.value as exportVal, i.year from  importDf1 i inner join exportDf1 e on i.HSCode = e.HSCode; ")

In [38]:
joinedData.head(500)

     HSCode  importVal  exportVal  year
0         5        0.0        NaN  2018
1         5        0.0        NaN  2018
2         5        0.0        NaN  2018
3         5        0.0        NaN  2018
4         5        0.0        NaN  2018
..      ...        ...        ...   ...
495       5        0.0       0.03  2018
496       5        0.0       0.03  2018
497       5        0.0       0.03  2018
498       5        0.0       0.03  2018
499       5        0.0       0.03  2018

[500 rows x 4 columns]